//*** #0 не делятся на 3 ****************************************************************

// var i = 1;
// while (i <= 100) {
//     if (i % 3 !== 0) {
//         document.write(i + "<br>");
//     }
//     i++;
// }


//*** #1  делятся на Х ****************************************************************

// var num = parseInt(prompt("Введите число: "));
// var i = 1;
// var sum = 0;
// while (i <= 100) {
//     if (i % num === 0) {
//         sum++;
//     }
//     i++;
// }
// alert("Количество чисел, которые делятся на "+num+" = "+sum);


//*** #2  шаг между числами ****************************************************************

// var numA = parseInt(prompt("Введите первое число: "));
// var numB = parseInt(prompt("Введите второе число: "));
// var numC = parseInt(prompt("Введите шаг: "));
//
// while (numA < numB) {
//     document.write(numA + "<br>");
//     numA += numC;
// }

//*** #3 таблица умножения ****************************************************************

// var i=1;
// while (i<=10){
//     var j=1;
//     while (j<=10) {
//         document.write(i + "*" + j + "=" + (i * j)+"<br>");
//         j++;
//     }
//     i++;
// }

//*** #4 пирамидка из слов ****************************************************************

// var word =prompt("Введите слово: ");
// var row = parseInt(prompt("Введите число строк: "));
// var i=0;
// while (i<row) {
//     var j=0;
//     while (j<=i){
//         document.write(word+"&nbsp ");
//         j++;
//     }
//     document.write("<br>");
//     i++;
// }

//*** #5 сумма цифр числа ****************************************************************

var num = parseInt(prompt("Введите число: "));
var sum=0;
while (num>10){
    sum+=num%10;
    num=parseInt( num/10);
}
if (num<10)sum+=num;
alert(sum);

